/*
  # Предзаполнение данными

  1. Вставка классов
  2. Вставка учеников для класса 11-Ё
*/

-- Вставка классов
INSERT INTO classes (name) VALUES
  ('2-А'), ('2-Б'), ('2-В'), ('2-Г'), ('2-Д'), ('2-Е'),
  ('3-ВUT'), ('3-А'), ('3-Б'), ('3-В'), ('3-Г'), ('3-Д'),
  ('4-А'), ('4-Б'), ('4-В'), ('4-Г'), ('4-Д'), ('4-Е'),
  ('5-А'), ('5-Б'), ('5-В'),
  ('6-А'), ('6-Б'), ('6-В'), ('6-Г'),
  ('7-А'), ('7-Б'), ('7-В'), ('7-Г'), ('7-Д'), ('7-Е'),
  ('8-Е'), ('8-А'), ('8-Б'), ('8-В'), ('8-Г'), ('8-Д'),
  ('9-А'), ('9-А УТ'), ('9-Б'), ('9-В'), ('9-Г'), ('9-Д'), ('9-Е'), ('9-Ё'),
  ('10-А'), ('10-Б'), ('10-В'), ('10-Г'), ('10-Д'), ('10-Е'),
  ('11-А'), ('11-Б'), ('11-В'), ('11-Д'), ('11-Е'), ('11-Ё')
ON CONFLICT (name) DO NOTHING;

-- Получение ID класса 11-Ё для вставки учеников
DO $$
DECLARE
  class_11_yo_id uuid;
BEGIN
  SELECT id INTO class_11_yo_id FROM classes WHERE name = '11-Ё';
  
  -- Вставка учеников класса 11-Ё
  INSERT INTO students (class_id, name) VALUES
    (class_11_yo_id, 'Абдумаликова Зебохон Иброхимхужа Кизи'),
    (class_11_yo_id, 'Абдухамидов Азизжон Нодир Угли'),
    (class_11_yo_id, 'Азимжонов Умаржон Нодир Угли'),
    (class_11_yo_id, 'Гуломова Нилуфар Нажмиддин Қизи'),
    (class_11_yo_id, 'Демирчи-Огли Амаль Мустафаевич'),
    (class_11_yo_id, 'Исмаилова Оминахон Аббор Кизи'),
    (class_11_yo_id, 'Исроилов Ёкубжон Даврон Угли'),
    (class_11_yo_id, 'Мадиев Саидазизхон Азамжон Угли'),
    (class_11_yo_id, 'Мукминов Рамазан Рустамович'),
    (class_11_yo_id, 'Муродова Нозимахон Анвар Кизи'),
    (class_11_yo_id, 'Наврузова Севинч Навруз Қизи'),
    (class_11_yo_id, 'Расулжонов Азиз Фуркатжонович'),
    (class_11_yo_id, 'Саипова Шарофат Мурод Қизи'),
    (class_11_yo_id, 'Содиков Абдулкаюм Алоуддин Угли'),
    (class_11_yo_id, 'Султонмуродов Саидумаржон Рустам Угли'),
    (class_11_yo_id, 'Талипова Зухра Шахобиддин Кизи'),
    (class_11_yo_id, 'Туйчиева Мубинабону Давроновна'),
    (class_11_yo_id, 'Тураева Наргиза Тожи Қизи'),
    (class_11_yo_id, 'Турсунбоев Ботиржон Бахтиер Угли'),
    (class_11_yo_id, 'Уримбаева Дурдона Бахрамовна'),
    (class_11_yo_id, 'Усмонахужаев Саид Жалол Мухаммад Али Угли'),
    (class_11_yo_id, 'Юлдашев Исмоил Ихтиерович'),
    (class_11_yo_id, 'Юнусов Абдусаид Нурали Угли'),
    (class_11_yo_id, 'Юнусова Муниса Тоировна')
  ON CONFLICT DO NOTHING;
END $$;